> suzuki-shunsuke mavogel is there a discord / slack for this project?

Sorry but I don't know because recently I became a collaborator.

---

I have confirmed the crash is solved by this pull request.

```
$ terraform apply                                                                                                                                    

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_network.vlan will be created
  + resource "docker_network" "vlan" {
      + driver      = (known after apply)
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "pr-8"
      + options     = (known after apply)
      + scope       = (known after apply)

      + ipam_config {
          + aux_address = {
              + "foo" = "192.168.1.5"
            }
          + subnet      = "192.168.0.0/16"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

docker_network.vlan: Creating...
docker_network.vlan: Creation complete after 2s [id=227b69944c4ddb549245f305206a7e3a76ba18af8f1eaa0077f893f3850a4020]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```